In [1]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df=pd.read_csv(r"C:\CDAC\ML\Topic10\Coal Consumption.csv")

In [3]:
df

         Month  Amount  Extract_month  Extract Year
0     1/1/1990   16.50              1          1990
1     2/1/1990   15.17              2          1990
2     3/1/1990   12.75              3          1990
3     4/1/1990   12.31              4          1990
4     5/1/1990    8.34              5          1990
..         ...     ...            ...           ...
127   8/1/2000    8.31              8          2000
128   9/1/2000    6.87              9          2000
129  10/1/2000    5.45             10          2000
130  11/1/2000   11.29             11          2000
131  12/1/2000   18.21             12          2000

[132 rows x 4 columns]

In [10]:
df['Month']=pd.to_datetime(df['Month'])

In [11]:
df.set_index('Month',inplace=True)

In [12]:
df.loc['1990-01':'1990-07']

            Amount  Extract_month  Extract Year
Month
1990-01-01   16.50              1          1990
1990-02-01   15.17              2          1990
1990-03-01   12.75              3          1990
1990-04-01   12.31              4          1990
1990-05-01    8.34              5          1990
1990-06-01    8.63              6          1990
1990-07-01   12.37              7          1990

# Missing Values

In [6]:
# This is normal data missing values.Entire rows are missing.
# Find out dates which were supposed to be there but are missing
df.isnull().sum()

Month            0
Amount           0
Extract_month    0
Extract Year     0
dtype: int64

In [7]:
df.asfreq('MS') # start of the month is represented by MS

           Month  Amount  Extract_month  Extract Year
1970-01-01   NaN     NaN            NaN           NaN